//// C̵̲̋͑̈́ḥ̶̡̤̻͚͎̳̈́̂̍̉̂̋̍̄̎̈̐̀͋̏͝i̸̢̢̗͈̘͑̇̆͗̓̽͋̽̅͐̈́͆͛̋͜͝ͅc̶̨͕̰̤͙̬̦̮̮͇̾̀̓̀̽̽͛̔͋̈̍̀́͂̔ķ̴̦̦̦̬̙̜̻͎͉͎̾̂̂̂͌͒̆͑̕͝ȩ̴̥͚̳̯̪̘̰̂́̉̊̽̎̅̑̽̅̃͘̚͠n̴̢̢̘̭̲͕͓̲̭̼̲̥̍́͒̀̿̽͋̀̅̅̈́́ ̵̛̝͍̼̰̮̻̮̜̼̟͍̘͍͓̞̏̓̿̓͂͗̌͋̍̽͘͝͝͝b̵̨̗͖͚͓̻̱̳̯͉̘̪̦́ơ̴̡̯̆̃̄̾̈́̉͐̋̎͘̚͝y̶͕̺͕͈͔͋̒̊͋̈́ C̵̲̋͑̈́ḥ̶̡̤̻͚͎̳̈́̂̍̉̂̋̍̄̎̈̐̀͋̏͝i̸̢̢̗͈̘͑̇̆͗̓̽͋̽̅͐̈́͆͛̋͜͝ͅc̶̨͕̰̤͙̬̦̮̮͇̾̀̓̀̽̽͛̔͋̈̍̀́͂̔ķ̴̦̦̦̬̙̜̻͎͉͎̾̂̂̂͌͒̆͑̕͝ȩ̴̥͚̳̯̪̘̰̂́̉̊̽̎̅̑̽̅̃͘̚͠n̴̢̢̘̭̲͕͓̲̭̼̲̥̍́͒̀̿̽͋̀̅̅̈́́ ̵̛̝͍̼̰̮̻̮̜̼̟͍̘͍͓̞̏̓̿̓͂͗̌͋̍̽͘͝͝͝b̵̨̗͖͚͓̻̱̳̯͉̘̪̦́ơ̴̡̯̆̃̄̾̈́̉͐̋̎͘̚͝y̶͕̺͕͈͔͋̒̊͋̈́ C̵̲̋͑̈́ḥ̶̡̤̻͚͎̳̈́̂̍̉̂̋̍̄̎̈̐̀͋̏͝i̸̢̢̗͈̘͑̇̆͗̓̽͋̽̅͐̈́͆͛̋͜͝ͅc̶̨͕̰̤͙̬̦̮̮͇̾̀̓̀̽̽͛̔͋̈̍̀́͂̔ķ̴̦̦̦̬̙̜̻͎͉͎̾̂̂̂͌͒̆͑̕͝ȩ̴̥͚̳̯̪̘̰̂́̉̊̽̎̅̑̽̅̃͘̚͠n̴̢̢̘̭̲͕͓̲̭̼̲̥̍́͒̀̿̽͋̀̅̅̈́́ ̵̛̝͍̼̰̮̻̮̜̼̟͍̘͍͓̞̏̓̿̓͂͗̌͋̍̽͘͝͝͝b̵̨̗͖͚͓̻̱̳̯͉̘̪̦́ơ̴̡̯̆̃̄̾̈́̉͐̋̎͘̚͝y̶͕̺͕͈͔͋̒̊͋̈́ C̵̲̋͑̈́ḥ̶̡̤̻͚͎̳̈́̂̍̉̂̋̍̄̎̈̐̀͋̏͝i̸̢̢̗͈̘͑̇̆͗̓̽͋̽̅͐̈́͆͛̋͜͝ͅc̶̨͕̰̤͙̬̦̮̮͇̾̀̓̀̽̽͛̔͋̈̍̀́͂̔ķ̴̦̦̦̬̙̜̻͎͉͎̾̂̂̂͌͒̆͑̕͝ȩ̴̥͚̳̯̪̘̰̂́̉̊̽̎̅̑̽̅̃͘̚͠n̴̢̢̘̭̲͕͓̲̭̼̲̥̍́͒̀̿̽͋̀̅̅̈́́ ̵̛̝͍̼̰̮̻̮̜̼̟͍̘͍͓̞̏̓̿̓͂͗̌͋̍̽͘͝͝͝b̵̨̗͖͚͓̻̱̳̯͉̘̪̦́ơ̴̡̯̆̃̄̾̈́̉͐̋̎͘̚͝y̶͕̺͕͈͔͋̒̊͋̈́ C̵̲̋͑̈́ḥ̶̡̤̻͚͎̳̈́̂̍̉̂̋̍̄̎̈̐̀͋̏͝i̸̢̢̗͈̘͑̇̆͗̓̽͋̽̅͐̈́͆͛̋͜͝ͅc̶̨͕̰̤͙̬̦̮̮͇̾̀̓̀̽̽͛̔͋̈̍̀́͂̔ķ̴̦̦̦̬̙̜̻͎͉͎̾̂̂̂͌͒̆͑̕͝ȩ̴̥͚̳̯̪̘̰̂́̉̊̽̎̅̑̽̅̃͘̚͠n̴̢̢̘̭̲͕͓̲̭̼̲̥̍́͒̀̿̽͋̀̅̅̈́́ ̵̛̝͍̼̰̮̻̮̜̼̟͍̘͍͓̞̏̓̿̓͂͗̌͋̍̽͘͝͝͝b̵̨̗͖͚͓̻̱̳̯͉̘̪̦́ơ̴̡̯̆̃̄̾̈́̉͐̋̎͘̚͝y̶͕̺͕͈͔͋̒̊͋̈́ C̵̲̋͑̈́ḥ̶̡̤̻͚͎̳̈́̂̍̉̂̋̍̄̎̈̐̀͋̏͝i̸̢̢̗͈̘͑̇̆͗̓̽͋̽̅͐̈́͆͛̋͜͝ͅc̶̨͕̰̤͙̬̦̮̮͇̾̀̓̀̽̽͛̔͋̈̍̀́͂̔ķ̴̦̦̦̬̙̜̻͎͉͎̾̂̂̂͌͒̆͑̕͝ȩ̴̥͚̳̯̪̘̰̂́̉̊̽̎̅̑̽̅̃͘̚͠n̴̢̢̘̭̲͕͓̲̭̼̲̥̍́͒̀̿̽͋̀̅̅̈́́ ̵̛̝͍̼̰̮̻̮̜̼̟͍̘͍͓̞̏̓̿̓͂͗̌͋̍̽͘͝͝͝b̵̨̗͖͚͓̻̱̳̯͉̘̪̦́ơ̴̡̯̆̃̄̾̈́̉͐̋̎͘̚͝y̶͕̺͕͈͔͋̒̊͋̈́ ////



class CfgVehicles
{
	class I_soldier_F;
	class Aegis_ChickenBoy_F: I_soldier_F
	{
		author 				= $STR_A3_A_AveryTheKitty;
		scope 				= protected;
		scopeCurator 		= public;
		displayName 		= "C̵̲̋͑̈́ḥ̶̡̤̻͚͎̳̈́̂̍̉̂̋̍̄̎̈̐̀͋̏͝i̸̢̢̗͈̘͑̇̆͗̓̽͋̽̅͐̈́͆͛̋͜͝ͅc̶̨͕̰̤͙̬̦̮̮͇̾̀̓̀̽̽͛̔͋̈̍̀́͂̔ķ̴̦̦̦̬̙̜̻͎͉͎̾̂̂̂͌͒̆͑̕͝ȩ̴̥͚̳̯̪̘̰̂́̉̊̽̎̅̑̽̅̃͘̚͠n̴̢̢̘̭̲͕͓̲̭̼̲̥̍́͒̀̿̽͋̀̅̅̈́́ ̵̛̝͍̼̰̮̻̮̜̼̟͍̘͍͓̞̏̓̿̓͂͗̌͋̍̽͘͝͝͝b̵̨̗͖͚͓̻̱̳̯͉̘̪̦́ơ̴̡̯̆̃̄̾̈́̉͐̋̎͘̚͝y";
		model				= "\A3_Aegis\Animals_F_Aegis\ChickenBoy.p3d";
		modelSides[] 		= {3};
		uniformClass		= Aegis_U_ChickenBoy_F;
	};
};
class CfgWeapons
{
	class Uniform_Base;
	class UniformItem;
	class Aegis_U_ChickenBoy_F: Uniform_Base
	{
		author 						= $STR_A3_A_AveryTheKitty;
		scope 						= protected;
		scopeArsenal 				= private;
		displayName 				= "C̵̲̋͑̈́ḥ̶̡̤̻͚͎̳̈́̂̍̉̂̋̍̄̎̈̐̀͋̏͝i̸̢̢̗͈̘͑̇̆͗̓̽͋̽̅͐̈́͆͛̋͜͝ͅc̶̨͕̰̤͙̬̦̮̮͇̾̀̓̀̽̽͛̔͋̈̍̀́͂̔ķ̴̦̦̦̬̙̜̻͎͉͎̾̂̂̂͌͒̆͑̕͝ȩ̴̥͚̳̯̪̘̰̂́̉̊̽̎̅̑̽̅̃͘̚͠n̴̢̢̘̭̲͕͓̲̭̼̲̥̍́͒̀̿̽͋̀̅̅̈́́ ̵̛̝͍̼̰̮̻̮̜̼̟͍̘͍͓̞̏̓̿̓͂͗̌͋̍̽͘͝͝͝b̵̨̗͖͚͓̻̱̳̯͉̘̪̦́ơ̴̡̯̆̃̄̾̈́̉͐̋̎͘̚͝y";
		model 						= "\A3\Characters_F\Common\Suitpacks\suitpack_universal_F.p3d";
		hiddenSelections[] 			= {camo};
		picture 					= "\A3_Aegis\Characters_F_Aegis\Uniforms\Data\UI\icon_U_B_GhillieSuit_wdl_f_CA.paa";
		hiddenSelectionsTextures[] 	= {"\A3\Characters_F_Enoch\Uniforms\Suitpacks\Data\suitpack_soldier_B_W_CO.paa"};
		class ItemInfo: UniformItem
		{
			uniformModel 			= "-";
			uniformClass 			= Aegis_ChickenBoy_F;
			containerClass 			= Supply50;
			mass 					= 10;
		};
	};
};